## Terraform Plan for `infrastructure/global/iam`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.tls_certificate.github: Reading...
data.tls_certificate.github: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
data.aws_iam_policy_document.s3_upload_policy_doc["rss-db-backup"]: Reading...
data.aws_iam_policy_document.s3_upload_policy_doc["cires-reports-uploader"]: Reading...
aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::668144156539:oidc-provider/token.actions.githubusercontent.com]
aws_iam_user.s3_upload_user["cires-reports-uploader"]: Refreshing state... [id=cires-reports-uploader]
data.aws_iam_policy_document.terraform_permissions: Reading...
data.aws_iam_policy_document.s3_upload_policy_doc["cires-reports-uploader"]: Read complete after 0s [id=585527393]
data.aws_iam_policy_document.s3_upload_policy_doc["rss-db-backup"]: Read complete after 0s [id=1374653543]
aws_iam_policy.s3_upload_policy["cires-reports-uploader"]: Refreshing state... [id=arn:aws:iam::668144156539:policy/cires-reports-upload-policy]
data.aws_iam_policy_document.terraform_permissions: Read complete after 0s [id=859818116]
aws_iam_policy.terraform_permissions_policy: Refreshing state... [id=arn:aws:iam::668144156539:policy/terraform-permissions-policy]
data.aws_iam_policy_document.assume_role_policy: Reading...
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=4151157637]
aws_iam_role.github_actions_terraform_role: Refreshing state... [id=github-actions-terraform-role]
aws_iam_user_policy_attachment.s3_upload_policy_attachment["cires-reports-uploader"]: Refreshing state... [id=cires-reports-uploader-20250713161207344700000001]
aws_iam_role_policy_attachment.terraform_role_attachment: Refreshing state... [id=github-actions-terraform-role-20250821170043957000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.s3_upload_policy["cires-reports-uploader"] must be replaced
  # (moved from aws_iam_policy.s3_upload_policy)
-/+ resource "aws_iam_policy" "s3_upload_policy" {
      ~ arn              = "arn:aws:iam::668144156539:policy/cires-reports-upload-policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Policy allowing uploading objects to CIRES report buckets" -> "Policy allowing uploading objects to buckets for cires-reports-uploader" # forces replacement
      ~ id               = "arn:aws:iam::668144156539:policy/cires-reports-upload-policy" -> (known after apply)
      ~ name             = "cires-reports-upload-policy" -> "cires-reports-uploader-policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPAZXED6X55XZF2LDQS3" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.s3_upload_policy["rss-db-backup"] will be created
  + resource "aws_iam_policy" "s3_upload_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy allowing uploading objects to buckets for rss-db-backup"
      + id               = (known after apply)
      + name             = "rss-db-backup-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cap-rss-pg-backups/*"
                      + Sid      = "AllowS3Uploads"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cap-rss-pg-backups"
                      + Sid      = "AllowBucketListing"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user.s3_upload_user has moved to aws_iam_user.s3_upload_user["cires-reports-uploader"]
    resource "aws_iam_user" "s3_upload_user" {
        id                   = "cires-reports-uploader"
        name                 = "cires-reports-uploader"
        tags                 = {
            "AKIAZXED6X55WJGG2JL5" = "CIRES - Server"
            "AKIAZXED6X55WTOJMJ7K" = "Access from Daniels PC"
            "Description"          = "User for uploading objects to CIRES report buckets"
            "Environment"          = "Stage and Production"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_user.s3_upload_user["rss-db-backup"] will be created
  + resource "aws_iam_user" "s3_upload_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "rss-db-backup"
      + path          = "/service-users/"
      + tags          = {
          + "Description" = "User for uploading objects for CAP RSS database backups"
          + "Environment" = "Stage and Production"
        }
      + tags_all      = {
          + "Description" = "User for uploading objects for CAP RSS database backups"
          + "Environment" = "Stage and Production"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.s3_upload_policy_attachment["cires-reports-uploader"] must be replaced
  # (moved from aws_iam_user_policy_attachment.s3_upload_policy_attachment)
-/+ resource "aws_iam_user_policy_attachment" "s3_upload_policy_attachment" {
      ~ id         = "cires-reports-uploader-20250713161207344700000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::668144156539:policy/cires-reports-upload-policy" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_user_policy_attachment.s3_upload_policy_attachment["rss-db-backup"] will be created
  + resource "aws_iam_user_policy_attachment" "s3_upload_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "rss-db-backup"
    }

Plan: 5 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Daniel-Ibarrola, Action: `pull_request`*